Revit 2027 API
ParameterTypeId.RebarAlignmentOptions Property
 "Bar Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarAlignmentOptions { get; }
Public Shared ReadOnly Property RebarAlignmentOptions As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarAlignmentOptions {
	ForgeTypeId^ get ();
}
static member RebarAlignmentOptions : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace